r5-a_read.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 32 tps: 16704.26 qps: 167048.87 (r/w/o: 167048.87/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 18145.46 qps: 181455.62 (r/w/o: 181455.62/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 19467.52 qps: 194675.59 (r/w/o: 194675.59/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 19963.43 qps: 199633.57 (r/w/o: 199633.57/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 20872.51 qps: 208725.24 (r/w/o: 208725.24/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 20992.52 qps: 209925.36 (r/w/o: 209925.36/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 21009.85 qps: 210099.56 (r/w/o: 210099.56/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 20769.12 qps: 207690.18 (r/w/o: 207690.18/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 20951.66 qps: 209515.67 (r/w/o: 209515.67/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 20968.11 qps: 209681.36 (r/w/o: 209681.36/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 20800.86 qps: 208009.09 (r/w/o: 208009.09/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 20961.81 qps: 209618.54 (r/w/o: 209618.54/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 20996.32 qps: 209962.28 (r/w/o: 209962.28/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 20804.06 qps: 208039.88 (r/w/o: 208039.88/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 20892.16 qps: 208922.68 (r/w/o: 208922.68/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 20938.38 qps: 209382.99 (r/w/o: 209382.99/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 20869.12 qps: 208692.32 (r/w/o: 208692.32/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 21011.34 qps: 210114.19 (r/w/o: 210114.19/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 21024.21 qps: 210241.59 (r/w/o: 210241.59/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 20872.23 qps: 208721.97 (r/w/o: 208721.97/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 20954.05 qps: 209541.59 (r/w/o: 209541.59/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 21089.56 qps: 210894.27 (r/w/o: 210894.27/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 20957.00 qps: 209570.26 (r/w/o: 209570.26/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 21126.98 qps: 211270.64 (r/w/o: 211270.64/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 21253.96 qps: 212537.90 (r/w/o: 212537.90/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 21038.59 qps: 210388.60 (r/w/o: 210388.60/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 21101.77 qps: 211016.95 (r/w/o: 211016.95/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 21136.34 qps: 211361.82 (r/w/o: 211361.82/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 20928.17 qps: 209283.34 (r/w/o: 209283.34/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 20994.99 qps: 209949.65 (r/w/o: 209949.65/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            123919880
        write:                           0
        other:                           0
        total:                           123919880
    transactions:                        12391988 (20652.84 per sec.)
    queries:                             123919880 (206528.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0124s
    total number of events:              12391988

Latency (ms):
         min:                                    1.08
         avg:                                    1.55
         max:                                  406.49
         95th percentile:                        1.86
         sum:                             19180592.68

Threads fairness:
    events (avg/stddev):           387249.6250/6076.17
    execution time (avg/stddev):   599.3935/0.03