r5-a_rw.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 2343.06 qps: 46917.54 (r/w/o: 32852.98/9374.69/4689.87) lat (ms,95%): 32.53 err/s: 0.55 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2456.32 qps: 49117.42 (r/w/o: 34379.63/9824.41/4913.38) lat (ms,95%): 29.72 err/s: 0.75 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2513.26 qps: 50293.70 (r/w/o: 35210.71/10056.01/5026.98) lat (ms,95%): 29.19 err/s: 0.45 reconn/s: 0.00
[ 80s ] thds: 64 tps: 2513.53 qps: 50258.20 (r/w/o: 35177.25/10053.13/5027.81) lat (ms,95%): 29.19 err/s: 0.75 reconn/s: 0.00
[ 100s ] thds: 64 tps: 2506.02 qps: 50165.10 (r/w/o: 35116.77/10035.79/5012.55) lat (ms,95%): 29.19 err/s: 0.50 reconn/s: 0.00
[ 120s ] thds: 64 tps: 2561.98 qps: 51227.64 (r/w/o: 35863.39/10239.64/5124.62) lat (ms,95%): 28.67 err/s: 0.75 reconn/s: 0.00
[ 140s ] thds: 64 tps: 2567.30 qps: 51375.21 (r/w/o: 35966.26/10273.50/5135.45) lat (ms,95%): 28.67 err/s: 0.75 reconn/s: 0.00
[ 160s ] thds: 64 tps: 2577.21 qps: 51523.55 (r/w/o: 36063.91/10304.71/5154.93) lat (ms,95%): 28.67 err/s: 0.50 reconn/s: 0.00
[ 180s ] thds: 64 tps: 2585.25 qps: 51752.89 (r/w/o: 36227.46/10354.32/5171.11) lat (ms,95%): 28.16 err/s: 0.60 reconn/s: 0.00
[ 200s ] thds: 64 tps: 2605.09 qps: 52071.06 (r/w/o: 36451.55/10408.72/5210.79) lat (ms,95%): 28.16 err/s: 0.60 reconn/s: 0.00
[ 220s ] thds: 64 tps: 2600.38 qps: 52003.23 (r/w/o: 36400.22/10402.03/5200.97) lat (ms,95%): 28.16 err/s: 0.50 reconn/s: 0.00
[ 240s ] thds: 64 tps: 2626.35 qps: 52551.18 (r/w/o: 36791.40/10506.49/5253.29) lat (ms,95%): 27.66 err/s: 0.30 reconn/s: 0.00
[ 260s ] thds: 64 tps: 2623.97 qps: 52515.05 (r/w/o: 36765.23/10501.13/5248.69) lat (ms,95%): 27.66 err/s: 0.75 reconn/s: 0.00
[ 280s ] thds: 64 tps: 2629.46 qps: 52606.53 (r/w/o: 36820.97/10526.24/5259.32) lat (ms,95%): 28.16 err/s: 0.40 reconn/s: 0.00
[ 300s ] thds: 64 tps: 2660.30 qps: 53206.45 (r/w/o: 37251.06/10634.19/5321.19) lat (ms,95%): 27.17 err/s: 0.60 reconn/s: 0.00
[ 320s ] thds: 64 tps: 2651.83 qps: 53044.21 (r/w/o: 37134.13/10605.67/5304.41) lat (ms,95%): 27.66 err/s: 0.75 reconn/s: 0.00
[ 340s ] thds: 64 tps: 2637.87 qps: 52771.55 (r/w/o: 36936.71/10558.79/5276.04) lat (ms,95%): 28.16 err/s: 0.50 reconn/s: 0.00
[ 360s ] thds: 64 tps: 2668.35 qps: 53387.07 (r/w/o: 37372.05/10677.31/5337.71) lat (ms,95%): 27.66 err/s: 0.80 reconn/s: 0.00
[ 380s ] thds: 64 tps: 2661.69 qps: 53228.19 (r/w/o: 37267.88/10635.97/5324.33) lat (ms,95%): 28.16 err/s: 0.95 reconn/s: 0.00
[ 400s ] thds: 64 tps: 2645.09 qps: 52917.16 (r/w/o: 37042.30/10583.67/5291.19) lat (ms,95%): 28.67 err/s: 1.00 reconn/s: 0.00
[ 420s ] thds: 64 tps: 2692.15 qps: 53855.00 (r/w/o: 37702.47/10767.57/5384.96) lat (ms,95%): 26.68 err/s: 0.65 reconn/s: 0.00
[ 440s ] thds: 64 tps: 2691.14 qps: 53838.86 (r/w/o: 37690.00/10765.82/5383.04) lat (ms,95%): 27.17 err/s: 0.75 reconn/s: 0.00
[ 460s ] thds: 64 tps: 2677.68 qps: 53529.79 (r/w/o: 37462.41/10711.42/5355.96) lat (ms,95%): 28.16 err/s: 0.65 reconn/s: 0.00
[ 480s ] thds: 64 tps: 2702.42 qps: 54111.19 (r/w/o: 37884.00/10821.55/5405.65) lat (ms,95%): 27.17 err/s: 0.75 reconn/s: 0.00
[ 500s ] thds: 64 tps: 2708.52 qps: 54131.62 (r/w/o: 37889.74/10824.13/5417.74) lat (ms,95%): 27.17 err/s: 0.70 reconn/s: 0.00
[ 520s ] thds: 64 tps: 2689.60 qps: 53813.40 (r/w/o: 37674.50/10759.10/5379.80) lat (ms,95%): 28.16 err/s: 0.60 reconn/s: 0.00
[ 540s ] thds: 64 tps: 2716.68 qps: 54363.59 (r/w/o: 38061.40/10867.93/5434.26) lat (ms,95%): 27.17 err/s: 0.90 reconn/s: 0.00
[ 560s ] thds: 64 tps: 2715.92 qps: 54300.88 (r/w/o: 38004.12/10864.33/5432.44) lat (ms,95%): 27.17 err/s: 0.60 reconn/s: 0.00
[ 580s ] thds: 64 tps: 2707.83 qps: 54179.37 (r/w/o: 37929.97/10833.13/5416.27) lat (ms,95%): 27.17 err/s: 0.60 reconn/s: 0.00
[ 600s ] thds: 64 tps: 2730.29 qps: 54632.72 (r/w/o: 38250.75/10920.89/5461.07) lat (ms,95%): 27.17 err/s: 0.50 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            22033032
        write:                           6294109
        other:                           3147187
        total:                           31474328
    transactions:                        1573399 (2621.57 per sec.)
    queries:                             31474328 (52442.01 per sec.)
    ignored errors:                      389    (0.65 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.1727s
    total number of events:              1573399

Latency (ms):
         min:                                    5.74
         avg:                                   24.41
         max:                                  173.17
         95th percentile:                       28.67
         sum:                             38399429.21

Threads fairness:
    events (avg/stddev):           24584.3594/27.93
    execution time (avg/stddev):   599.9911/0.03