r5-a_write.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 5420.58 qps: 32532.67 (r/w/o: 0.00/21686.67/10846.01) lat (ms,95%): 15.27 err/s: 1.65 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5851.46 qps: 35118.91 (r/w/o: 0.00/23413.79/11705.12) lat (ms,95%): 13.70 err/s: 2.20 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5950.33 qps: 35700.79 (r/w/o: 0.00/23800.08/11900.71) lat (ms,95%): 13.22 err/s: 2.15 reconn/s: 0.00
[ 80s ] thds: 64 tps: 5933.73 qps: 35623.54 (r/w/o: 0.00/23751.77/11871.76) lat (ms,95%): 13.22 err/s: 2.20 reconn/s: 0.00
[ 100s ] thds: 64 tps: 6039.61 qps: 36239.19 (r/w/o: 0.00/24157.76/12081.43) lat (ms,95%): 13.22 err/s: 2.20 reconn/s: 0.00
[ 120s ] thds: 64 tps: 6018.54 qps: 36121.42 (r/w/o: 0.00/24082.58/12038.84) lat (ms,95%): 13.22 err/s: 1.75 reconn/s: 0.00
[ 140s ] thds: 64 tps: 6025.34 qps: 36157.68 (r/w/o: 0.00/24104.85/12052.83) lat (ms,95%): 13.46 err/s: 2.15 reconn/s: 0.00
[ 160s ] thds: 64 tps: 6124.06 qps: 36745.25 (r/w/o: 0.00/24494.33/12250.92) lat (ms,95%): 12.75 err/s: 2.85 reconn/s: 0.00
[ 180s ] thds: 64 tps: 6070.14 qps: 36434.21 (r/w/o: 0.00/24292.07/12142.14) lat (ms,95%): 13.46 err/s: 1.80 reconn/s: 0.00
[ 200s ] thds: 64 tps: 6059.36 qps: 36363.51 (r/w/o: 0.00/24242.29/12121.22) lat (ms,95%): 13.70 err/s: 2.50 reconn/s: 0.00
[ 220s ] thds: 64 tps: 6118.92 qps: 36718.51 (r/w/o: 0.00/24478.97/12239.54) lat (ms,95%): 13.22 err/s: 1.70 reconn/s: 0.00
[ 240s ] thds: 64 tps: 6047.84 qps: 36285.57 (r/w/o: 0.00/24189.13/12096.44) lat (ms,95%): 13.95 err/s: 2.60 reconn/s: 0.00
[ 260s ] thds: 64 tps: 6069.22 qps: 36429.38 (r/w/o: 0.00/24287.39/12141.99) lat (ms,95%): 13.70 err/s: 1.70 reconn/s: 0.00
[ 280s ] thds: 64 tps: 6079.47 qps: 36469.41 (r/w/o: 0.00/24308.67/12160.74) lat (ms,95%): 13.46 err/s: 1.80 reconn/s: 0.00
[ 300s ] thds: 64 tps: 6070.18 qps: 36439.80 (r/w/o: 0.00/24296.95/12142.85) lat (ms,95%): 13.70 err/s: 2.50 reconn/s: 0.00
[ 320s ] thds: 64 tps: 6093.41 qps: 36567.14 (r/w/o: 0.00/24378.33/12188.81) lat (ms,95%): 13.22 err/s: 2.00 reconn/s: 0.00
[ 340s ] thds: 64 tps: 6085.85 qps: 36521.25 (r/w/o: 0.00/24347.50/12173.75) lat (ms,95%): 13.46 err/s: 2.05 reconn/s: 0.00
[ 360s ] thds: 64 tps: 6112.98 qps: 36680.16 (r/w/o: 0.00/24451.91/12228.25) lat (ms,95%): 13.46 err/s: 2.30 reconn/s: 0.00
[ 380s ] thds: 64 tps: 6052.78 qps: 36327.50 (r/w/o: 0.00/24219.60/12107.90) lat (ms,95%): 13.70 err/s: 2.35 reconn/s: 0.00
[ 400s ] thds: 64 tps: 6117.47 qps: 36707.77 (r/w/o: 0.00/24470.73/12237.04) lat (ms,95%): 13.95 err/s: 2.10 reconn/s: 0.00
[ 420s ] thds: 64 tps: 6122.20 qps: 36741.81 (r/w/o: 0.00/24495.51/12246.30) lat (ms,95%): 13.46 err/s: 1.95 reconn/s: 0.00
[ 440s ] thds: 64 tps: 6125.08 qps: 36756.31 (r/w/o: 0.00/24504.25/12252.05) lat (ms,95%): 13.70 err/s: 1.85 reconn/s: 0.00
[ 460s ] thds: 64 tps: 6136.25 qps: 36821.61 (r/w/o: 0.00/24547.66/12273.95) lat (ms,95%): 13.22 err/s: 1.45 reconn/s: 0.00
[ 480s ] thds: 64 tps: 6074.87 qps: 36452.05 (r/w/o: 0.00/24299.57/12152.48) lat (ms,95%): 13.70 err/s: 2.75 reconn/s: 0.00
[ 500s ] thds: 64 tps: 6119.28 qps: 36727.74 (r/w/o: 0.00/24486.87/12240.86) lat (ms,95%): 13.70 err/s: 2.30 reconn/s: 0.00
[ 520s ] thds: 64 tps: 6144.89 qps: 36875.65 (r/w/o: 0.00/24583.56/12292.08) lat (ms,95%): 13.22 err/s: 2.30 reconn/s: 0.00
[ 540s ] thds: 64 tps: 6108.91 qps: 36659.31 (r/w/o: 0.00/24439.49/12219.82) lat (ms,95%): 13.46 err/s: 2.00 reconn/s: 0.00
[ 560s ] thds: 64 tps: 6092.80 qps: 36563.84 (r/w/o: 0.00/24375.80/12188.05) lat (ms,95%): 13.70 err/s: 2.45 reconn/s: 0.00
[ 580s ] thds: 64 tps: 6164.12 qps: 36990.96 (r/w/o: 0.00/24660.57/12330.39) lat (ms,95%): 13.22 err/s: 2.15 reconn/s: 0.00
[ 600s ] thds: 64 tps: 6103.37 qps: 36618.53 (r/w/o: 0.00/24409.64/12208.89) lat (ms,95%): 13.70 err/s: 2.15 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           14525351
        other:                           7262742
        total:                           21788093
    transactions:                        3630732 (6050.47 per sec.)
    queries:                             21788093 (36308.99 per sec.)
    ignored errors:                      1278   (2.13 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0730s
    total number of events:              3630732

Latency (ms):
         min:                                    3.76
         avg:                                   10.58
         max:                                   62.58
         95th percentile:                       13.70
         sum:                             38396420.19

Threads fairness:
    events (avg/stddev):           56730.1875/91.11
    execution time (avg/stddev):   599.9441/0.01